app/views/assignments/_form.html.erb

SELECT "roles".* FROM "roles"
---
	<% else %>
		<%= f.collection_select :role_id, Role.all, :id, :name, :prompt => "Select ..." %>