app/views/credits/_form.html.erb

    <%= f.label :category_category %><br />
	<%= f.collection_select :credit_category_id, CreditCategory.all, :id, :category, :prompt => "Select ..." %>
---
SELECT "credit_categories".* FROM "credit_categories"


	<%= f.collection_select :account_id, Account.all, :id, :id, :prompt => "Select ..." %>
---
SELECT "accounts".* FROM "accounts"