app/views/debits/_form.html.erb

<%= form_for @debit do |a| %>
	<%= a.collection_select :debit_category, DebitCategory.all, :id, :category, :prompt=>true %>
---
SELECT "debit_categories".* FROM "debit_categories" ORDER BY id ASC