app/controllers/accounts_controller.rb

	def show
		@account = Account.find(params[:id])
		authorize! :read, @account, :message => "Action Not Authorized"
		@inactive_accounts = Account.inactive_for_club(@account.club)
		# all debits for active account of @club
		@account_debits = @account.debits.paginate :page => params[:page], :per_page => 5
---
SELECT "accounts".* FROM "accounts" WHERE ("accounts"."id" = 1) LIMIT 1
SELECT "clubs".* FROM "clubs" WHERE ("clubs"."id" = 2) LIMIT 1

	def create
		@account = Account.new(params[:account])
		@account.active = true

		respond_to do |format|
			if @account.save
---
INSERT INTO "accounts" ("year", "club_id", "created_at", "updated_at") VALUES (2010, 2, '2011-02-20 07:08:32.851669', '2011-02-20 07:08:32.851669')