app/controllers/assignments_controller.rb

  def index
    @assignments = Assignment.all
---
SELECT "assignments".* FROM "assignments"

  def new
    @assignment = Assignment.new
	@assignment.club_id = params[:club]
	authorize! :create, @assignment, :message => "no"

	unless @assignment.club_id.nil?
	# you are assigning to club
		@club = @assignment.club
		#get all the role not filled for club
		@available_roles = @assignment.club.roles_available
		@available_users = User.free_users(@club)
		#@club.free_users
	else
		unless @assignment.roles_for_vp_and_sysadmin.nil? || @assignment.roles_for_vp_and_sysadmin.empty?
			@roles = @assignment.roles_for_vp_and_sysadmin
		end
		p @roles
		p @assignment.available_users.empty?
---
SELECT "clubs".* FROM "clubs" ORDER BY name
SELECT "roles".* FROM "roles"
SELECT "users".* FROM "users"

  def create
    @assignment = Assignment.new(params[:assignment])
	@assignment.active = true
	should_send = false
	@user = @assignment.user
	authorize! :create, @assignment, :message => "no"

	unless @user.nil?
		if @assignment.user.assignments.nil? || @assignment.user.assignments.empty?
			should_send = true
		end
	end

    respond_to do |format|
      if @assignment.save
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
INSERT INTO "assignments" ("role_id", "club_id", "user_id", "active", "created_at", "updated_at") VALUES (1, 1, '2', NULL, '2011-02-20 11:29:49.078652', '2011-02-20 11:29:49.078652')

  def destroy
    @assignment = Assignment.find(params[:id])
	@assignment.destroy!
---
SELECT "assignments".* FROM "assignments" WHERE ("assignments"."id" = 1) LIMIT 1
DELETE FROM "assignments" WHERE ("assignments"."id" = 1)