app/controllers/clubs_controller.rb

	def index
		@clubs = Club.all.paginate :page => params[:page], :per_page => 20
---
SELECT "clubs".* FROM "clubs" ORDER BY name

	def show
		#Scope Definitions
		@club = Club.find(params[:id])
---
SELECT "clubs".* FROM "clubs" WHERE ("clubs"."id" = 1) LIMIT 1

	def create
		@club = Club.new(params[:club])

		respond_to do |format|
		  if @club.save
---
INSERT INTO "clubs" ("name", "created_at", "updated_at") VALUES ('Gaming Club', '2011-02-19 06:43:37.905959', '2011-02-19 06:43:37.905959')

	def destroy
		@club = Club.find(params[:id])
		@club.destroy
---
SELECT "clubs".* FROM "clubs" WHERE ("clubs"."id" = 1) LIMIT 1
DELETE FROM "clubs" WHERE ("clubs"."id" = 1)