app/controllers/credit_categories_controller.rb

  def index
    @credit_categories = CreditCategory.all
---
SELECT "credit_categories".* FROM "credit_categories"