app/controllers/debit_categories_controller.rb

  def index
	if current_user.is_admin?
		@debit_categories = DebitCategory.all.paginate :page => params[:page], :per_page => 5
---
SELECT "debit_categories".* FROM "debit_categories" ORDER BY id ASC

  def show
	if current_user.is_admin?
		@debit_category = DebitCategory.find(params[:id])
---
SELECT "debit_categories".* FROM "debit_categories" WHERE ("debit_categories"."id" = 1) LIMIT 1

  def create
    @debit_category = DebitCategory.new(params[:debit_category])

    respond_to do |format|
      if @debit_category.save
---
INSERT INTO "debit_categories" ("active", "category", "created_at", "updated_at") VALUES (NULL, 'pretty good pizza', '2011-02-18 19:30:03.663247', '2011-02-18 19:30:03.663247')

  def destroy
    @debit_category = DebitCategory.find(params[:id])
    @debit_category.destroy
---
SELECT "debit_categories".* FROM "debit_categories" WHERE ("debit_categories"."id" = 1) LIMIT 1
DELETE FROM "debit_categories" WHERE ("debit_categories"."id" = 1)