app/controllers/debits_controller.rb

  def index
    @debits = Debit.all.paginate :page => params[:page], :per_page => 5
---
SELECT "debits".* FROM "debits" ORDER BY debit.account_id