app/controllers/roles_controller.rb

  def show
    @role = Role.find(params[:id])
---
SELECT "roles".* FROM "roles" WHERE ("roles"."id" = 1) LIMIT 1

  def create
    @role = Role.new(params[:role])

    respond_to do |format|
      if @role.save
---
INSERT INTO "roles" ("active", "name", "created_at", "updated_at") VALUES ('f', 'shit', '2011-02-18 20:01:28.384047', '2011-02-18 20:01:28.384047')

  def destroy
    @role = Role.find(params[:id])
    @role.destroy
---
SELECT "roles".* FROM "roles" WHERE ("roles"."id" = 1) LIMIT 1
DELETE FROM "roles" WHERE ("roles"."id" = 1)