app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "middle_name", "last_name", "username", "email", "password_hash", "password_salt", "created_at", "updated_at") VALUES ('jp', 'k', 'menniti', 'jp', 'jmenniti@andrew.cmu.edu', '$2a$10$GuW5jw8cLMhggZNTo9J7/uYsyDLyRcDIFRTpEU16zpaLnxSlhy5yK', '$2a$10$GuW5jw8cLMhggZNTo9J7/u', '2011-02-19 06:44:17.734466', '2011-02-19 06:44:17.734466')
---
	def create
		@user = User.new(params[:user])
		authorize! :create, @user, :message => "Action Not Authorized"
		respond_to do |format|
		  if @user.save

UPDATE "users" SET "password_salt" = '$2a$10$ngRV10gEoFl.0GuRFWYWJ.', "password_hash" = '$2a$10$ngRV10gEoFl.0GuRFWYWJ.eUdI1HWc2.7A.KgQEGPh.5ZAxRWMw4C', "updated_at" = '2011-02-20 11:26:21.727487' WHERE ("users"."id" = 1)
---
	def update
		@user = current_user
		if @user.update_attributes(params[:user])