app/views/accounts/_form.html.erb

    <%= f.label :club %> <br />
	<%= f.collection_select :club_id, Club.all, :id, :name, :prompt => "Select ..." %>
---
SELECT "clubs".* FROM "clubs" ORDER BY name